Catalogs/ЦеныУслугРаскрояПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЦеныУслугРаскрояПоставщиков</Name>
			<Comment>Установка цен на услуги производства поставщиков</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВнутренниеВырезы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьВырезыApply</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДлинаПользовательскихШвов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДлинаШвов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДлинаШвовМногофактурный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьКривые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьУглы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьФотопечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураУслугиЦентровкиШва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценкиЗаЦентровкуШва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЦентровкиШваНеВключаетСтоимостьУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Углы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВырезыApply</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фотопечать</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДлинаШвов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДлинаПользовательскихШвов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВнутренниеВырезы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Кривые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДлинаШвовМногофактурный</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЦеныУслугРаскрояПоставщиков/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуНоменклатурИЦен(Знач ВидЦен, Знач КоличествоУслуги, Знач ТабличнаяЧасть, Знач Валюта, Знач Дата)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Номенклатура");
	ТаблицаРезультата.Колонки.Добавить("Количество");
	ТаблицаРезультата.Колонки.Добавить("Цена");
	
	//++ №7926 Проверим может установлен флаг не учитывать на всю ТЧ
	Если ВидЦен["НеУчитывать" + ТабличнаяЧасть] Тогда
		Возврат ТаблицаРезультата;
	КонецЕсли;
	//-- №7926
	
	Если КоличествоУслуги = 0 Тогда
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	ПересчитыватьВВалютуПараметра = Ложь;
	Если НЕ ВидЦен.Валюта = Валюта Тогда
		ПересчитыватьВВалютуПараметра = Истина;
	КонецЕсли;
	
	#Область ДоЗаявки11866
	//КоличествоБесплатнойУслуги = 0;
	//
	////определим количество бесплатных элементов, заданные в прайсе
	//Для Каждого ТекущаяСтрока Из ВидЦен[ТабличнаяЧасть] Цикл
	//	
	//	//++ №7926 проверка на флаг "Не учитывать"
	//	Если ТекущаяСтрока.НеУчитывать Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	//-- №7926
	//	
	//	//Если ТекущаяСтрока.КоличествоОт = 0 И ТекущаяСтрока.Цена = 0 Тогда
	//	Если ТекущаяСтрока.Цена = 0 Тогда
	//		
	//		НоваяСтрока = ТаблицаРезультата.Добавить();
	//		
	//		Если КоличествоУслуги <= ТекущаяСтрока.КоличествоДо Тогда
	//			НоваяСтрока.Количество = КоличествоУслуги;
	//			КоличествоБесплатнойУслуги = КоличествоУслуги;
	//		Иначе
	//			НоваяСтрока.Количество = ТекущаяСтрока.КоличествоДо;
	//			КоличествоБесплатнойУслуги = ТекущаяСтрока.КоличествоДо;
	//		КонецЕсли;
	//		
	//		
	//		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
	//		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	////теперь определим настройку стоимости углов и её номенклатуру (по общему количеству углов в заказе)
	//Если (КоличествоУслуги - КоличествоБесплатнойУслуги) > 0 Тогда
	//	Для Каждого ТекущаяСтрока Из ВидЦен[ТабличнаяЧасть] Цикл
	//		
	//		//++ №7926 проверка на флаг "Не учитывать"
	//		Если ТекущаяСтрока.НеУчитывать Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		//-- №7926
	//		
	//		Если (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт ) и (КоличествоУслуги <= ТекущаяСтрока.КоличествоДо) Тогда
	//			НоваяСтрока = ТаблицаРезультата.Добавить();
	//			НоваяСтрока.Количество = КоличествоУслуги-КоличествоБесплатнойУслуги;
	//			ЦенаВПрайсе = ТекущаяСтрока.Цена;
	//			
	//			Если ПересчитыватьВВалютуПараметра Тогда
	//				НоваяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВидЦен.Валюта, Валюта, Дата, ЦенаВПрайсе);
	//			Иначе
	//				НоваяСтрока.Цена = ЦенаВПрайсе
	//			КонецЕсли;
	//			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	#КонецОбласти
	
	//#11866
	// определим настройку стоимости услуги и её номенклатуру (по общему количеству услуги в заказе)
	Для Каждого ТекущаяСтрока Из ВидЦен[ТабличнаяЧасть] Цикл
		Если ТекущаяСтрока.НеУчитывать Тогда
			Продолжить;
		КонецЕсли;
		КоличествоВхожденияВДиапазон = 0;
		Если (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт) 
			И (КоличествоУслуги >= ТекущаяСтрока.КоличествоДо) 
			И (ТекущаяСтрока.КоличествоОт <= ТекущаяСтрока.КоличествоДо) Тогда
			КоличествоВхожденияВДиапазон = Мин(ТекущаяСтрока.КоличествоДо, ТекущаяСтрока.КоличествоДо - ТекущаяСтрока.КоличествоОт + 1);
			
		ИначеЕсли (КоличествоУслуги >= ТекущаяСтрока.КоличествоОт) 
			И (КоличествоУслуги < ТекущаяСтрока.КоличествоДо) 
			И (ТекущаяСтрока.КоличествоОт <= ТекущаяСтрока.КоличествоДо) Тогда
			КоличествоВхожденияВДиапазон = КоличествоУслуги - ТекущаяСтрока.КоличествоОт + 1;
		КонецЕсли;
		
		Если КоличествоВхожденияВДиапазон > 0 Тогда		
			НоваяСтрока = ТаблицаРезультата.Добавить();
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.Количество = КоличествоВхожденияВДиапазон;
			ЦенаВПрайсе = ТекущаяСтрока.Цена;			
			
			Если ПересчитыватьВВалютуПараметра Тогда
				НоваяСтрока.Цена = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ВидЦен.Валюта, Валюта, Дата, ЦенаВПрайсе);
			Иначе
				НоваяСтрока.Цена = ЦенаВПрайсе;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	//проверим, для всех ли элементов нашлись настройки, если нет - добавим пустую номенклатуру
	Если ТаблицаРезультата.Итог("Количество") < КоличествоУслуги Тогда
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.Количество = КоличествоУслуги - ТаблицаРезультата.Итог("Количество");
	КонецЕсли;
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенУглов(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "Углы", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенКривых(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "Кривые", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенВнутренниеВырезы(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "ВнутренниеВырезы", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенВырезыApply(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "ВырезыApply", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенФотопечать(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "Фотопечать", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенДлинаШвов(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "ДлинаШвов", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенДлинаПользовательскихШвов(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "ДлинаПользовательскихШвов", Валюта, Дата);
	
КонецФункции

Функция ПолучитьТаблицуНоменклатурИЦенДлинаШвовМногофактурный(Знач ВидЦен, Знач КоличествоУслуги, Знач Валюта, Знач Дата) Экспорт
	
	Возврат ПолучитьТаблицуНоменклатурИЦен(ВидЦен, КоличествоУслуги, "ДлинаШвовМногофактурный", Валюта, Дата);
	
КонецФункции

Функция ПолучитьДействующийПрайсПоставщикаНаУслугиПроизводства(Знач ВидЦеныПоставщика, Знач Дата) Экспорт
//Функция ПолучитьДействующийПрайсПоставщикаНаУслугиПроизводства(Знач Поставщик, Знач Дата) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	ИначеЕсли Дата = Дата(1,1,1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Результат = Справочники.ЦеныУслугРаскрояПоставщиков.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствиеВидовЦенПоставщиковЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскрояПоставщика КАК ВидЦен
	|ИЗ
	|	РегистрСведений.СоответствиеВидовЦенПоставщиковЦенамУслугРаскроя.СрезПоследних(&Дата, ВидЦеныПоставщика = &ВидЦен) КАК СоответствиеВидовЦенПоставщиковЦенамУслугРаскрояСрезПоследних";
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидЦен", ВидЦеныПоставщика);
	
	//"ВЫБРАТЬ
	//|	ЦеныУслугРаскрояПоставщиков.Ссылка
	//|ИЗ
	//|	Справочник.ЦеныУслугРаскрояПоставщиков КАК ЦеныУслугРаскрояПоставщиков
	//|ГДЕ
	//|	ЦеныУслугРаскрояПоставщиков.Контрагент = &Контрагент
	//|	И НЕ ЦеныУслугРаскрояПоставщиков.ПометкаУдаления
	//|	И ЦеныУслугРаскрояПоставщиков.Дата <= &Дата
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЦеныУслугРаскрояПоставщиков.Дата УБЫВ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.ВидЦен;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
